package com.javarush.task.Examples.example2;

public class Solution {
    public static void main(String[] args) {
        /**
        *  ~  Поразрядный оператор "НЕ" (меняет 1 на 0 и наоборот)
        *  &  Поразрядный оператор "И" (true толлько если оба операнда true)
        *  |  поразрядный оператор "или" (true если один из операнд равен 1, false если оба равны 0)
        *  ^  поразрядный оператор "исключающее или" (если 2 операнда равны, то на их месте будет противоположный, если разные, то true)
        *  >>  побитовый сдвиг вправо (прибавляет 0 сначала, длина побитового числа остается преждним)
        *  >>> побитовый сдвиг вправо с заполнением нулями (делит число пополам, меняет местами если 1, если 2 - то прибавляет 0 сначала)
        *  << сдвиг влево (умнажает числа на 2 в десятичной системе исчисления)
        *
        *
        * */
    }
}
